
## Environment: prd ✅
#### Terraform Format and Style ✅
<details><summary>Show improper formatted and/or styled files</summary>

```


```

</details>

#### Terraform Initialization ✅
<details><summary>Show initialization details</summary>

```


[0m[1mInitializing the backend...[0m

[0m[1mInitializing provider plugins...[0m
- Finding hashicorp/aws versions matching "~> 5.60.0"...
- Installing hashicorp/aws v5.60.0...
- Installed hashicorp/aws v5.60.0 (signed by HashiCorp)

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m

```

</details>

#### Terraform Validation ✅
<details><summary>Show validation details</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan ✅
<details><summary>Show plan</summary> 

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_user.this will be created
  + resource "aws_iam_user" "this" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "bob"
      + path          = "/"
      + tags          = {
          + "src" = "cloud-aws-ops-demo"
        }
      + tags_all      = {
          + "src" = "cloud-aws-ops-demo"
        }
      + unique_id     = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: terraform_plan_prd

To perform exactly these actions, run the following command to apply:
    terraform apply "terraform_plan_prd"

```

</details>

#### Context
Actor: @matthias-kuklinski
Trigger: `pull_request`
GitHub Action Reference: [10142106455](https://github.com/matthias-kuklinski/cloud-aws-ops-demo/actions/runs/10142106455)
